# Модуль для хранения текстового содержимого

main_menu = ['Главное меню',
             'Открыть файл',
             'Сохранить файл',
             'Показать контакт',
             'Добавить контакт',
             'Найти контакт',
             'Изменить контакт',
             'Удалить контакт',
             'Выход']

main_menu_erro = "Вы ввели некоретное значение повторите ввод"

requests = "Выберите пункт меню"

zero = "от 0 до "

goodbye = "goodbye".upper()

empty_directory = """
            ******************************
            * Телефонный справочник пуст  *
            ******************************
            """

directory = """
            ******************************
            *    Телефонный справочник    *
            ******************************
            """
tabl = ['ФИО', 'Телефон', 'Коментарий']

open_file = """
            ******************************
            * Справчник успешно загружен *
            ******************************
            """
save = """
            ******************************
            *     Изменения сохранены     *
            ******************************
            """
exit_s = """
            ******************************
            *         goodbye            *
            ******************************
            """
text_add_cotacs = """
            ******************************
            *  Контакт успешно добавлен  *
            ******************************
            """
contact_not_find = """
            ******************************
            *     Контакт не найден      *
            ******************************
            """
contct_find = """
            ******************************
            *     Контакт  найден        *
            ******************************
            """
contact_change = """
            ******************************
            *  Контакт  успешно изменён  *
            ******************************
            """
what_change = """
            *******************************************************
            *   Сначало введите данные на которые хотите поменять *
            *    далее Введите контакт у кого хотите поменять     *
            *******************************************************
            """
delet_contact = """
            ******************************
            *  Контакт  успешно удалён  *
            ******************************
            """
save_toexit = """
            ******************************
            *     Сохранить изменения    *
            *       перед выходом        *
            ******************************
            """